<?php
// Массиви (різноманітні корисні функції)
// Злиття массивів

//$arr1 = ['my', 'text'];
//$arr2 = [2 => 'our', 3 => 'some'];
//$sum = $arr1 + $arr2;
$arr1 = ['my', 'text', 2 => 'tt'];
$arr2 = ['our', 'some', 'text2'];
$sum = array_merge($arr1, $arr2);
// Якщо массиви мають однакові індекси, ми побачимо значення лівого массиву
echo "<pre>";
print_r($sum);
echo "</pre>" . "<br>";

// Злиття массивів

$a1 = [1, 3, 5, 7, 9];
$a2 = [1, 3, 5, '7', 9];
$a3 = [1, 3, 5, 7];
$a4 = [1, 3, 5, 7, 9];

if ($a1 == $a2) {
    echo "Массиви рівні<br>";
}else{
    echo "Массиви не рівні<br>";
}

if ($a1 == $a3) {
    echo "Массиви рівні<br>";
}else{
    echo "Массиви не рівні<br>";
}
// ===
$arr11 = [0 => 1, 1 => 2];
$arr22 = [0 => 1, 1 => '2'];

if ($arr11 === $arr22) {
    echo "Массиви рівні<br>";
}else{
    echo "Массиви не рівні<br>";
}

// Перевірка існування массиву
// isset()
for ($i=0; $i <= 6; $i++) {
    if (isset($a1[$i])) {
       echo "Єлемент массиву \$a1[$i] існує<br>";
    }else {
        echo "Єлемент массиву \$a1[$i] не існує<br>";
    }
}

//is array() - перевіряє чи являється змінна массивом
if (is_array($arr22)) {
    echo "Змінна \$arr22 є массивом<br>";
}else{
    echo "Змінна \$arr22 не є массивом<br>";
}

// in_array() - перевіряє значення массиву на співпадіння (== or 3param = true)
if (in_array(7, $a2, true)){
    echo "цифра 7 існує у массиві";
}else{
    echo "цифра 7 не існує у массиві";
}
// array_key_exists(key, array) - ДЗ

// видалення єлементів массиву unset()
//unset($a2) - видалення усього массиву;
//unset($a2[2]);
//echo "<pre>";
//print_r($a2);
//echo "</pre> . <br>";


